## SQL Alıştırma - 1

In [3]:
%load_ext sql

In [4]:
%sql sqlite:///veri_tabani_ilk.db

In [5]:
%%sql
SELECT * FROM Customers LIMIT 5;

 * sqlite:///veri_tabani_ilk.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

#### 1. Orders tablosundaki müşteri sayısı kaç?

In [20]:
%%sql
SELECT COUNT(CustomerID) FROM Orders;

 * sqlite:///veri_tabani_ilk.db
Done.

[(196,)]

#### 2. Orders tablosundaki EŞSİZ müşteri sayısı kaç?

In [19]:
%%sql
SELECT COUNT(DISTINCT CustomerID) FROM Customers;

 * sqlite:///veri_tabani_ilk.db
Done.

[(91,)]

#### 3. Customers tablosunda hangi ülkeden kaçar tane müşteri var?

In [21]:
%%sql
SELECT Country, COUNT(CustomerID) FROM Customers GROUP BY Country ORDER BY COUNT(CustomerID) DESC LIMIT 5;

 * sqlite:///veri_tabani_ilk.db
Done.

[('USA', 13), ('Germany', 11), ('France', 11), ('Brazil', 9), ('UK', 7)]

#### 4. Müşterilerin ülkesi Brazil ya da USA olanları bulunuz.

In [25]:
%%sql
SELECT * FROM Customers WHERE Country="Brazil" OR Country="USA" LIMIT 3;

 * sqlite:///veri_tabani_ilk.db
Done.

[(15, 'Comércio Mineiro', 'Pedro Afonso', 'Av. dos Lusíadas, 23', 'São Paulo', '05432-043', 'Brazil'),
 (21, 'Familia Arquibaldo', 'Aria Cruz', 'Rua Orós, 92', 'São Paulo', '05442-030', 'Brazil'),
 (31, 'Gourmet Lanchonetes', 'André Fonseca', 'Av. Brasil, 442', 'Campinas', '04876-786', 'Brazil')]

In [32]:
%%sql
SELECT * FROM Customers WHERE Country IN ('Brazil','USA') LIMIT 3;

 * sqlite:///veri_tabani_ilk.db
Done.

[(15, 'Comércio Mineiro', 'Pedro Afonso', 'Av. dos Lusíadas, 23', 'São Paulo', '05432-043', 'Brazil'),
 (21, 'Familia Arquibaldo', 'Aria Cruz', 'Rua Orós, 92', 'São Paulo', '05442-030', 'Brazil'),
 (31, 'Gourmet Lanchonetes', 'André Fonseca', 'Av. Brasil, 442', 'Campinas', '04876-786', 'Brazil')]

#### 5. Önce ülkeye sonra şehre göre group by işlemi yapıp bu kırılımda müşteri sayısını bulunuz.

In [41]:
%%sql
SELECT Country, City, COUNT(CustomerID) FROM Customers GROUP BY Country, City LIMIT 3;

 * sqlite:///veri_tabani_ilk.db
Done.

[('Argentina', 'Buenos Aires', 3),
 ('Austria', 'Graz', 1),
 ('Austria', 'Salzburg', 1)]

#### 6. Müşterilerin adreslerinin herhangi bir yerinde "da" ifadesi geçen tüm adresleri bulunuz.

In [43]:
%%sql
SELECT Address FROM Customers WHERE Address LIKE '%da%' LIMIT 3;

 * sqlite:///veri_tabani_ilk.db
Done.

[('Avda. de la Constitución 2222',),
 ('Sierras de Granada 9993',),
 ('Av. dos Lusíadas, 23',)]

#### 7. Germany-Berlin'de yaşayan müşteri/müşterilerin isimleri nelerdir?

In [44]:
%%sql
SELECT CustomerName FROM Customers WHERE Country='Germany' AND City='Berlin';

 * sqlite:///veri_tabani_ilk.db
Done.

[('Alfreds Futterkiste',)]

#### 8. Kanada'da yaşayıp isimlerinde "in" ifadesi geçen müşteri/müşterileri bulunuz.

In [51]:
%%sql
SELECT CustomerName FROM Customers WHERE Country='Canada' AND CustomerName LIKE '%in%';

 * sqlite:///veri_tabani_ilk.db
Done.

[('Laughing Bacchus Wine Cellars',)]

#### 9. Fiyatı 40 ila 90 TL arasında olan ürünlerin isimleri ve fiyatları nelerdir?

In [70]:
%%sql
SELECT ProductName, Price FROM Products WHERE Price>=40 AND Price<=90 LIMIT 3;

 * sqlite:///veri_tabani_ilk.db
Done.

[('Northwoods Cranberry Sauce', 40),
 ('Genen Shouyu', 43),
 ('Carnarvon Tigers', 62)]

In [61]:
%%sql
SELECT ProductName, Price FROM Products WHERE Price BETWEEN 40 AND 90 LIMIT 3;

 * sqlite:///veri_tabani_ilk.db
Done.

[('Northwoods Cranberry Sauce', 40),
 ('Genen Shouyu', 43),
 ('Carnarvon Tigers', 62)]

#### 10. Fiyatı 30 TL'den büyük olan ürünlerin isimlerini, fiyatlarını ve fiyatlarının karesini bulunuz ve tüm değişkenlerin isimlendirmelerini aşağıdaki şekilde yapınız.
* urun_ismi, urun_fiyati, urun_fiyati_karesi

In [73]:
%%sql
SELECT ProductName AS urun_ismi, Price AS urun_fiyati, Price*Price AS urun_fiyati_karesi FROM Products WHERE Price>=30 LIMIT 3;

 * sqlite:///veri_tabani_ilk.db
Done.

[("Uncle Bob's Organic Dried Pears", 30, 900),
 ('Northwoods Cranberry Sauce', 40, 1600),
 ('Mishi Kobe Niku', 97, 9409)]

#### 11. Products tablosundaki category_id'lerin yani kategorilerin isimleri nelerdir?

In [82]:
%%sql
SELECT Categories.CategoryName, Products.CategoryID FROM Products LEFT OUTER JOIN Categories ON Products.CategoryID = Categories.CategoryID LIMIT 5;

 * sqlite:///veri_tabani_ilk.db
Done.

[('Beverages', 1),
 ('Beverages', 1),
 ('Condiments', 2),
 ('Condiments', 2),
 ('Condiments', 2)]

#### 12. beverages ürün kategorisindeki ürünlerin fiyat ortalaması nedir?

In [86]:
%%sql
SELECT AVG(Price) FROM Products LEFT OUTER JOIN Categories ON Products.CategoryID = Categories.CategoryID WHERE CategoryName="Beverages";

 * sqlite:///veri_tabani_ilk.db
Done.

[(42.75,)]

In [87]:
%%sql
SELECT AVG(Price) FROM Products WHERE CategoryID=1;

 * sqlite:///veri_tabani_ilk.db
Done.

[(42.75,)]

#### 13. USA'da yaşayan müşterilerin kazandırdığı toplam kazancı bulunuz.

In [97]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///veri_tabani_ilk.db
Done.

[('Products',),
 ('Customers',),
 ('Categories',),
 ('Employees',),
 ('Orders',),
 ('Shippers',),
 ('Suppliers',),
 ('OrderDetails',),
 ('new_table',)]

In [102]:
%%sql
SELECT * FROM Products LIMIT 1;

 * sqlite:///veri_tabani_ilk.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18)]

In [103]:
%%sql
SELECT * FROM Orders LIMIT 1;

 * sqlite:///veri_tabani_ilk.db
Done.

[(10248, 90, 5, '4.07.1996', 3)]

In [104]:
%%sql
SELECT * FROM OrderDetails LIMIT 1;

 * sqlite:///veri_tabani_ilk.db
Done.

[(1, 10248, 11, 12)]

In [57]:
%%sql
SELECT * FROM Customers LIMIT 1;

 * sqlite:///veri_tabani_ilk.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')]

In [7]:
%%sql
SELECT * FROM OrderDetails LIMIT 1;

 * sqlite:///veri_tabani_ilk.db
Done.

[(1, 10248, 11, 12)]

In [64]:
%%sql
SELECT City, Price, Quantity, Price * Quantity AS TotalSales FROM Customers LEFT OUTER JOIN (SELECT * FROM Products LEFT OUTER JOIN (SELECT * FROM Orders LEFT OUTER JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID) AS Twin ON Products.ProductID = Twin.ProductID) AS Alll ON Customers.CustomerID = Alll.CustomerID WHERE Country = 'USA' LIMIT 5;

 * sqlite:///veri_tabani_ilk.db
Done.

[('Eugene', None, None, None),
 ('Elgin', 6, 10, 60),
 ('Elgin', 16, 10, 160),
 ('Elgin', 23, 15, 345),
 ('Elgin', 39, 2, 78)]

In [65]:
%%sql
SELECT SUM(Price * Quantity) AS TotalSales FROM Customers LEFT OUTER JOIN (SELECT * FROM Products LEFT OUTER JOIN (SELECT * FROM Orders LEFT OUTER JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID) AS Twin ON Products.ProductID = Twin.ProductID) AS Alll ON Customers.CustomerID = Alll.CustomerID WHERE Country = 'USA';

 * sqlite:///veri_tabani_ilk.db
Done.

[(108537,)]

#### 14. products tablosundaki categoryID'lerin isimlerini bulunuz ve sonrasında kategori başına ortalama ürün fiyatını gösteriniz.

In [31]:
%%sql
SELECT CategoryName, AVG(Price) FROM Products LEFT OUTER JOIN Categories ON Products.CategoryID = Categories.CategoryID GROUP BY CategoryName;

 * sqlite:///veri_tabani_ilk.db
Done.

[('Beverages', 42.75),
 ('Condiments', 28.25),
 ('Confections', 33.76923076923077),
 ('Dairy Products', 74.9),
 ('Grains/Cereals', 23.571428571428573),
 ('Meat/Poultry', 55.166666666666664),
 ('Produce', 32.2),
 ('Seafood', 26.5)]

#### 15. Çalışanları isimleri ile birlikte yaptıkları toplam satışlara göre sıralayınız.

In [52]:
%%sql
SELECT LastName || ' ' || FirstName AS FullName, SUM(Quantity * Price) AS TotalSales FROM Products LEFT OUTER JOIN (SELECT * FROM OrderDetails LEFT OUTER JOIN (SELECT * FROM Employees LEFT OUTER JOIN Orders ON Employees.EmployeeID = Orders.EmployeeID) AS Twin ON OrderDetails.OrderID = Twin.OrderID) AS TripleTable ON Products.ProductID = TripleTable.ProductID GROUP BY FullName ORDER BY TotalSales DESC;

 * sqlite:///veri_tabani_ilk.db
Done.

[('Peacock Margaret', 156706),
 ('Davolio Nancy', 106896),
 ('Suyama Michael', 88934),
 ('Leverling Janet', 68204),
 ('Buchanan Steven', 60293),
 ('King Robert', 54416),
 ('Callahan Laura', 43225),
 ('Fuller Andrew', 41294),
 ('Dodsworth Anne', 17656)]

In [33]:
%%sql
SELECT * FROM Employees LEFT OUTER JOIN Orders ON Employees.EmployeeID = Orders.EmployeeID LIMIT 3;

 * sqlite:///veri_tabani_ilk.db
Done.

[(1, 'Davolio', 'Nancy', '8.12.1968', 'EmpID1.pic', "Education includes a BA in psychology from Colorado State University. She also completed (The Art of the Cold Call). Nancy is a member of 'Toastmasters International'.", 10258, 20, 1, '17.07.1996', 1),
 (1, 'Davolio', 'Nancy', '8.12.1968', 'EmpID1.pic', "Education includes a BA in psychology from Colorado State University. She also completed (The Art of the Cold Call). Nancy is a member of 'Toastmasters International'.", 10270, 87, 1, '1.08.1996', 1),
 (1, 'Davolio', 'Nancy', '8.12.1968', 'EmpID1.pic', "Education includes a BA in psychology from Colorado State University. She also completed (The Art of the Cold Call). Nancy is a member of 'Toastmasters International'.", 10275, 49, 1, '7.08.1996', 1)]

#### 16. Almanya'dan verilen siparişlerin kategorilerine göre ortalama fiyatları nelerdir?

In [79]:
%%sql
SELECT CategoryName, AVG(Price) FROM Orders
LEFT OUTER JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
LEFT OUTER JOIN Customers ON Orders.CustomerID = Customers.CustomerID
LEFT OUTER JOIN Products ON OrderDetails.ProductID = Products.ProductID
LEFT OUTER JOIN Categories ON Categories.CategoryID = Products.CategoryID
WHERE Country = 'Germany'
GROUP BY CategoryName;

 * sqlite:///veri_tabani_ilk.db
Done.

[('Beverages', 20.5),
 ('Condiments', 34.0),
 ('Confections', 40.0),
 ('Dairy Products', 151.64705882352942),
 ('Grains/Cereals', 22.142857142857142),
 ('Meat/Poultry', 30.2),
 ('Produce', 30.75),
 ('Seafood', 27.09090909090909)]

#### 17. Almanya ya da USA'den verilen siparişlerin kategorilerine göre ortalama fiyatları nedir?

In [80]:
%%sql
SELECT CategoryName, AVG(Price) FROM Orders
LEFT OUTER JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
LEFT OUTER JOIN Customers ON Orders.CustomerID = Customers.CustomerID
LEFT OUTER JOIN Products ON OrderDetails.ProductID = Products.ProductID
LEFT OUTER JOIN Categories ON Categories.CategoryID = Products.CategoryID
WHERE Country IN ('Germany', 'USA')
GROUP BY CategoryName;

 * sqlite:///veri_tabani_ilk.db
Done.

[('Beverages', 29.88888888888889),
 ('Condiments', 34.72727272727273),
 ('Confections', 39.92307692307692),
 ('Dairy Products', 131.75862068965517),
 ('Grains/Cereals', 29.846153846153847),
 ('Meat/Poultry', 46.75),
 ('Produce', 28.625),
 ('Seafood', 25.6)]

#### 18. Temmuz, Ağustos, Eylül aylarında verilen siparişlerin ortalama fiyatı nedir?

In [95]:
%%sql
SELECT AVG(Price) FROM Orders
LEFT OUTER JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
LEFT OUTER JOIN Products ON OrderDetails.ProductID = Products.ProductID
WHERE OrderDate LIKE '%.07.%';

 * sqlite:///veri_tabani_ilk.db
Done.

[(38.0,)]

In [96]:
%%sql
SELECT AVG(Price) FROM Orders
LEFT OUTER JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
LEFT OUTER JOIN Products ON OrderDetails.ProductID = Products.ProductID
WHERE OrderDate LIKE '%.08.%';

 * sqlite:///veri_tabani_ilk.db
Done.

[(46.30434782608695,)]

In [97]:
%%sql
SELECT AVG(Price) FROM Orders
LEFT OUTER JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
LEFT OUTER JOIN Products ON OrderDetails.ProductID = Products.ProductID
WHERE OrderDate LIKE '%.09.%';

 * sqlite:///veri_tabani_ilk.db
Done.

[(33.526315789473685,)]

#### 19. Müşterilerin 1997 yılına ait siparişlerinin maksimum miktarlarını bulup müşterilerin isimleri ile birlikte büyükten küçüğe sıralayınız.

In [106]:
%%sql
SELECT CustomerName, Price * Quantity AS Total FROM Orders
LEFT OUTER JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
LEFT OUTER JOIN Customers ON Orders.CustomerID = Customers.CustomerID
LEFT OUTER JOIN Products ON OrderDetails.ProductID = Products.ProductID
LEFT OUTER JOIN Categories ON Categories.CategoryID = Products.CategoryID
WHERE OrderDate LIKE '%.1997'
GROUP BY CustomerName
ORDER BY Total;

 * sqlite:///veri_tabani_ilk.db
Done.

[('Blondel père et fils', 60),
 ('Franchi S.p.A.', 62),
 ('Hungry Coyote Import Store', 78),
 ('Folk och fä HB', 126),
 ('Que Delícia', 172),
 ('Queen Cozinha', 180),
 ('Consolidated Holdings', 190),
 ('Galería del gastrónomo', 190),
 ('Reggiani Caseifici', 240),
 ('Folies gourmandes', 260),
 ('Océano Atlántico Ltda.', 276),
 ('Split Rail Beer & Ale', 310),
 ("La maison d'Asie", 432),
 ('Rattlesnake Canyon Grocery', 450),
 ('Wartian Herkku', 460),
 ('LINO-Delicateses', 500),
 ('Ernst Handel', 540),
 ('Ottilies Käseladen', 630),
 ('Hungry Owl All-Night Grocers', 640),
 ('Toms Spezialitäten', 645),
 ('Familia Arquibaldo', 774),
 ('Piccolo und mehr', 805),
 ('Save-a-lot Markets', 855),
 ('Magazzini Alimentari Riuniti', 930),
 ('Princesa Isabel Vinhoss', 1064),
 ('Mère Paillarde', 1080),
 ('QUICK-Stop', 1140),
 ('Wellington Importadora', 1940),
 ('Richter Supermarkt', 2040),
 ('Bottom-Dollar Marketse', 2107),
 ('Old World Delicatessen', 2150),
 ('Eastern Connection', 2583),
 ('Gourmet Lanchonetes', 6090),
 ('Simons bistro', 13150)]

#### 20. Sipariş yılı 1997 olan siparişleri alan çalışanları sipariş alma sayılarına göre sıralayınız.

In [125]:
%%sql
SELECT FirstName || ' ' || LastName AS FullName, COUNT(*) FROM Employees 
LEFT OUTER JOIN Orders ON Orders.EmployeeID = Employees.EmployeeID
LEFT OUTER JOIN OrderDetails ON OrderDetails.OrderID = Orders.OrderID
LEFT OUTER JOIN Products ON Products.ProductID = OrderDetails.ProductID
WHERE OrderDate LIKE '%.1997'
GROUP BY FullName
ORDER BY COUNT(*) DESC;

 * sqlite:///veri_tabani_ilk.db
Done.

[('Janet Leverling', 31),
 ('Margaret Peacock', 26),
 ('Laura Callahan', 19),
 ('Robert King', 9),
 ('Andrew Fuller', 9),
 ('Nancy Davolio', 8),
 ('Michael Suyama', 8),
 ('Anne Dodsworth', 3)]

In [110]:
%%sql
SELECT * FROM Products LIMIT 1

 * sqlite:///veri_tabani_ilk.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18)]

In [111]:
%%sql
SELECT * FROM Orders LIMIT 1

 * sqlite:///veri_tabani_ilk.db
Done.

[(10248, 90, 5, '4.07.1996', 3)]

In [112]:
%%sql
SELECT * FROM OrderDetails LIMIT 1

 * sqlite:///veri_tabani_ilk.db
Done.

[(1, 10248, 11, 12)]

In [ ]:
%%sql
SELECT * FROM Orders LIMIT 1